{"keywords": ["legislation", "regulation", "directive", "treaty", "agenda", "report", "incentives"],
"Corporate sustainability reporting directive": " Corporate Sustainability Reporting Directive aims to foster sustainable and responsible corporate behavior throughout global value chains. This applies to companies which operate in the EU with 500+ employees and EUR 150 million+ in net turnover worldwide, or are part of high impact sectors. The proposal will create due diligence requirements for the human rights and environmental impact of companies. A requirement to report according to mandatory EU sustainability reporting standards requires companies to digitally ‘tag’ the reported information, so it is machine-readable and feeds into the European single access point envisaged in the capital markets union action plan. The proposal will be presented to the European Parliament and the Council for approval. Once adopted, Member States will have two years to transpose the Directive into national law and communicate the relevant texts to the Commission.",
"EU strategy for sustainable and circular textiles": " The Strategy lays out a forward-looking set of actions so that the EU textile market is broadly sustainable by 2030. The Commission will: * Set design requirements for textiles to make them last longer, easier to repair and recycle. * Introduce clearer information on textiles and a digital product passport for textiles based on mandatory information requirements on circularity and other key environmental aspects. * Empower consumers and tackle greenwashing by ensuring the accuracy of companies’ green claims. * Publish a transition pathway by the end of 2022 - an action plan for actors in the textiles ecosystem to successfully achieve the green and digital transitions and increase its resilience.",
"Battery (digital product) passport":  " Industrial rechargeable and EV batteries will require a digital battery passport detailing composition, sourcing and end of life processing info. More specifics on the implementation of these product passports will be announced in the coming years, with the aim of implementing the legislation in 2026.",
"Construction products regulation":  "This proposed revision has been adopted in 2022 and is designed to bring: * Requirements for greener and safer construction products * Improved digital product information for citizens, businesses and others * Easier delivery of harmonised standards on the performance of construction products * Rules to facilitate innovative business models such as 3D printing * Several of the proposed options also include implementation of digital product passports for these materials.",
"Waste framework directive update": "By 2025, the preparing for re-use and the recycling of municipal waste shall be increased to a minimum of 55%, 60% and 65% by weight by 2025, 2030 and 2035 respectively Extended producer responsibility. These measures may include the obligation to provide publicly available information as to the extent to which the product is re-usable and recyclable. Another revision of this legislation is currently taking place in 2022."}
